#include <iostream>
using namespace std;
void test()
{
    string s1 = "111111111111111"; //不交换动态数组地址
    string s2 = "222222222222222"; //不交换动态数组地址
    // string s1 = "111111111111111";//交换动态数组地址
    // string s2 = "222222222222222";//交换动态数组地址
    cout << "s1的内容:" << s1 << endl;
    cout << "s2的内容:" << s2 << endl;
    cout << "s1动态数据的地址:" << (void *)s1.data() << endl;
    cout << "s2动态数据的地址:" << (void *)s2.data() << endl;
    s1.swap(s2);
    cout << "交换后" << endl;
    cout << "s1的内容:" << s1 << endl;
    cout << "s2的内容:" << s2 << endl;
    cout << "s1动态数据的地址:" << (void *)s1.data() << endl;
    cout << "s2动态数据的地址:" << (void *)s2.data() << endl;
}
int main()
{
    test();
    return 0;
}

/* s1的内容:111111111111111
s2的内容:222222222222222
s1动态数据的地址:0x61fdc0
s2动态数据的地址:0x61fda0
交换后
s1的内容:222222222222222
s2的内容:111111111111111
s1动态数据的地址:0x61fdc0
s2动态数据的地址:0x61fda0


s1的内容:1111111111111111
s2的内容:2222222222222222
s1动态数据的地址:0x761760
s2动态数据的地址:0x761780
交换后
s1的内容:2222222222222222
s2的内容:1111111111111111
s1动态数据的地址:0x761780
s2动态数据的地址:0x761760 */